import streamlit as st


def render_head():
    st.markdown("""# 🌍 Демографический Навигатор
> **Два взгляда на одну реальность:** от научной иллюзии до азартного расчета.

---

### 🗺️ Выберите маршрут:

#### 🧐 Исследовать парадокс
Здесь мы разбираемся, почему наши глаза видят мир иначе, чем сухие отчеты. Это короткий разбор **«эффекта детской площадки»**:
* Почему детей из больших семей всегда кажется больше, чем их есть на самом деле?
* Как статистика водит нас за нос?
* Как работает «оптическая иллюзия» общества?

#### 🎰 Поиграть в казино
Твоя интуиция против миллиона случайных жизней. Это **симулятор демографического хаоса**:
1. Система генерирует «живые модели» мира.
2. Ты пытаешься угадать итог симуляции.
3. Выбирай сценарий и делай ставки в **Демо-коинах**.

*Проверь, сможешь ли ты вычислить реальность там, где логика обычно пасует.*

---

**Выбирай раздел и погнали!**
""")
