import streamlit as st


def render_head():
    st.markdown("""# 🏛 Институт парадоксов родства
**Департамент анализа искажений и социальных аномалий**

Добро пожаловать, коллега. Вы находитесь в стенах Института, где мы доказываем: реальность — это не то, что мы видим, а то, что мы можем рассчитать. Наша задача — вскрыть механизмы, которые заставляют человеческий мозг ошибаться в оценке масштабов общества.

---

### 📂 Объект исследования №1: «Окуляр Инспектора»
**Феномен:** Систематическое завышение среднего размера семьи в бытовом восприятии.

*   **Гипотеза:** Мы живем в «мире большинства», которого не существует. Наша память фиксирует не семьи, а людей. 
*   **Метод:** Сравнение истинного среднего (по родителям) и «наблюдаемого» (через каждого конкретного ребенка).
*   **Цель:** Увидеть разрыв между цифрой в отчете и толпой на улице.

---

### 📂 Объект исследования №2: «Генетическая экспансия»
**Феномен:** Критическая скорость заполнения пространства кровными связями.

*   **Гипотеза:** Любая группа из $N$ человек стремится стать семьей быстрее, чем предсказывает интуиция.
*   **Метод:** Моделирование «захвата» выборки детьми из многодетных кластеров.
*   **Цель:** Вычислить **Коэффициент тесноты мира** и точку неизбежного родства.

---

### 🚀 Инициировать запуск?

Выберите **режим сканирования** или введите **свои значения**. Система готова к построению графиков и вычислению вероятностей.

""")
